In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users={
    'User_ID': np.array([1,2,3,4,5]),
    'Username': ['vlad_g','marina_76','vadim_95','emma_09','vasilii_51'],
    'Age': [48,48,29,15,73],
    'Joined Date': pd.to_datetime(['2020-02-22','2021-09-17','2021-05-05','2019-11-10','2021-07-11']),
    'Total Posts': [100,245,303,789,120],
    'Reputation': [500,789,656,769,590],
}

df = pd.DataFrame(forum_users)
df

   User_ID    Username  Age Joined Date  Total Posts  Reputation
0        1      vlad_g   48  2020-02-22          100         500
1        2   marina_76   48  2021-09-17          245         789
2        3    vadim_95   29  2021-05-05          303         656
3        4     emma_09   15  2019-11-10          789         769
4        5  vasilii_51   73  2021-07-11          120         590

In [3]:
df[['Username','Age']]

     Username  Age
0      vlad_g   48
1   marina_76   48
2    vadim_95   29
3     emma_09   15
4  vasilii_51   73

In [8]:
df.loc[4]

User_ID                          5
Username                vasilii_51
Age                             73
Joined Date    2021-07-11 00:00:00
Total Posts                    120
Reputation                     590
Name: 4, dtype: object

In [9]:
df.loc[2:3]

   User_ID  Username  Age Joined Date  Total Posts  Reputation
2        3  vadim_95   29  2021-05-05          303         656
3        4   emma_09   15  2019-11-10          789         769

In [10]:
df.loc[2:3,['Username','Reputation']]

   Username  Reputation
2  vadim_95         656
3   emma_09         769

In [11]:
df.iloc[3]

User_ID                          4
Username                   emma_09
Age                             15
Joined Date    2019-11-10 00:00:00
Total Posts                    789
Reputation                     769
Name: 3, dtype: object

In [12]:
df.iloc[2:4]

   User_ID  Username  Age Joined Date  Total Posts  Reputation
2        3  vadim_95   29  2021-05-05          303         656
3        4   emma_09   15  2019-11-10          789         769

In [13]:
df.iloc[2:4,1:4]

   Username  Age Joined Date
2  vadim_95   29  2021-05-05
3   emma_09   15  2019-11-10

In [14]:
df.iloc[:,1:4]

     Username  Age Joined Date
0      vlad_g   48  2020-02-22
1   marina_76   48  2021-09-17
2    vadim_95   29  2021-05-05
3     emma_09   15  2019-11-10
4  vasilii_51   73  2021-07-11

In [18]:
df[df['Age']>=25]

   User_ID    Username  Age Joined Date  Total Posts  Reputation
0        1      vlad_g   48  2020-02-22          100         500
1        2   marina_76   48  2021-09-17          245         789
2        3    vadim_95   29  2021-05-05          303         656
4        5  vasilii_51   73  2021-07-11          120         590

In [24]:
df[df['Total Posts']>=300]

   User_ID  Username  Age Joined Date  Total Posts  Reputation
2        3  vadim_95   29  2021-05-05          303         656
3        4   emma_09   15  2019-11-10          789         769

In [26]:
df[df['Reputation']==500]

   User_ID Username  Age Joined Date  Total Posts  Reputation
0        1   vlad_g   48  2020-02-22          100         500

In [29]:
df[(df['Total Posts']>=300)&(df['Age']>=25)]

   User_ID  Username  Age Joined Date  Total Posts  Reputation
2        3  vadim_95   29  2021-05-05          303         656

In [32]:
df[(df['Total Posts']>=400) | (df['Age']<=35)]

   User_ID  Username  Age Joined Date  Total Posts  Reputation
2        3  vadim_95   29  2021-05-05          303         656
3        4   emma_09   15  2019-11-10          789         769

In [34]:
df['Reputation'].isin([200,500])

0     True
1    False
2    False
3    False
4    False
Name: Reputation, dtype: bool

In [35]:
df[df['Reputation'].isin([200,500])]

   User_ID Username  Age Joined Date  Total Posts  Reputation
0        1   vlad_g   48  2020-02-22          100         500

In [40]:
df[df['Total Posts'].isin(range(100,700))]

   User_ID    Username  Age Joined Date  Total Posts  Reputation
0        1      vlad_g   48  2020-02-22          100         500
1        2   marina_76   48  2021-09-17          245         789
2        3    vadim_95   29  2021-05-05          303         656
4        5  vasilii_51   73  2021-07-11          120         590

In [49]:
date_range=pd.date_range(start='2019-01-01', end='2021.01.01')
date_range

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2020-12-23', '2020-12-24', '2020-12-25', '2020-12-26',
               '2020-12-27', '2020-12-28', '2020-12-29', '2020-12-30',
               '2020-12-31', '2021-01-01'],
              dtype='datetime64[ns]', length=732, freq='D')

In [50]:
df[df['Joined Date'].isin(date_range)]

   User_ID Username  Age Joined Date  Total Posts  Reputation
0        1   vlad_g   48  2020-02-22          100         500
3        4  emma_09   15  2019-11-10          789         769